**GroupBy Mechanics**

In [5]:
import numpy as np
import pandas as pd

In [6]:
# split-apply-combine

In [7]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : np.random.randn(5),
    'data2' : np.random.randn(5)})

In [8]:
df

  key1 key2     data1     data2
0    a  one  1.113770  1.064311
1    a  two -0.003906 -0.334350
2    b  one -0.217493  1.096917
3    b  two  1.034529 -1.012263
4    a  one  0.400786 -0.814757

In [11]:
grouped = df['data1'].groupby(df['key1'])

In [12]:
grouped

In [13]:
grouped.mean()

key1
a    0.503550
b    0.408518
Name: data1, dtype: float64

In [14]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [15]:
means

key1  key2
a     one     0.757278
      two    -0.003906
b     one    -0.217493
      two     1.034529
Name: data1, dtype: float64

In [17]:
means.unstack()

key2       one       two
key1
a     0.757278 -0.003906
b    -0.217493  1.034529

In [18]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [19]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [20]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.003906
            2006   -0.217493
Ohio        2005    1.074150
            2006    0.400786
Name: data1, dtype: float64

In [21]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.503550 -0.028265
b     0.408518  0.042327

In [22]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.757278  0.124777
     two  -0.003906 -0.334350
b    one  -0.217493  1.096917
     two   1.034529 -1.012263

In [24]:
df.groupby(['key1', 'key2']).size()
# any missing values in a group key will be excluded from the result.

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

**Iterating Over Groups**

In [25]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.113770  1.064311
1    a  two -0.003906 -0.334350
4    a  one  0.400786 -0.814757
b
  key1 key2     data1     data2
2    b  one -0.217493  1.096917
3    b  two  1.034529 -1.012263

In [26]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.113770  1.064311
4    a  one  0.400786 -0.814757
('a', 'two')
  key1 key2     data1    data2
1    a  two -0.003906 -0.33435
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.217493  1.096917
('b', 'two')
  key1 key2     data1     data2
3    b  two  1.034529 -1.012263

In [27]:
pieces = dict(list(df.groupby('key1')))

In [31]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.217493  1.096917
3    b  two  1.034529 -1.012263

In [33]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [34]:
grouped = df.groupby(df.dtypes, axis=1)

In [37]:
grouped

In [36]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  1.113770  1.064311
1 -0.003906 -0.334350
2 -0.217493  1.096917
3  1.034529 -1.012263
4  0.400786 -0.814757
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

**Selecting a Column or Subset of Columns**

In [39]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [40]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [41]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.124777
     two  -0.334350
b    one   1.096917
     two  -1.012263

In [42]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [44]:
s_grouped.mean()

key1  key2
a     one     0.124777
      two    -0.334350
b     one     1.096917
      two    -1.012263
Name: data2, dtype: float64

**Grouping with Dicts and Series**

In [45]:
people = pd.DataFrame(np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [46]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [47]:
people

               a         b         c         d         e
Joe    -1.337049 -0.749849 -0.519087 -2.160621  0.820364
Steve   1.488460 -0.600062 -0.092358 -0.863685 -1.053120
Wes    -0.375171       NaN       NaN  0.696473 -2.011170
Jim    -0.120373 -0.766772 -0.218189  0.981070 -0.843640
Travis -0.561578 -1.644408 -0.440778  0.655612  1.439717

In [48]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [49]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [50]:
by_column = people.groupby(mapping, axis=1)

In [51]:
by_column.sum()

            blue       red
Joe    -2.679708 -1.266535
Steve  -0.956043 -0.164723
Wes     0.696473 -2.386342
Jim     0.762881 -1.730785
Travis  0.214835 -0.766270

In [52]:
map_series = pd.Series(mapping)

In [53]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [54]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

**Grouping with Functions**

In [58]:
people

               a         b         c         d         e
Joe    -1.337049 -0.749849 -0.519087 -2.160621  0.820364
Steve   1.488460 -0.600062 -0.092358 -0.863685 -1.053120
Wes    -0.375171       NaN       NaN  0.696473 -2.011170
Jim    -0.120373 -0.766772 -0.218189  0.981070 -0.843640
Travis -0.561578 -1.644408 -0.440778  0.655612  1.439717

In [60]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.832593 -1.516622 -0.737276 -0.483078 -2.034447
5  1.488460 -0.600062 -0.092358 -0.863685 -1.053120
6 -0.561578 -1.644408 -0.440778  0.655612  1.439717

In [56]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [57]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.337049 -0.749849 -0.519087 -2.160621 -2.011170
  two -0.120373 -0.766772 -0.218189  0.981070 -0.843640
5 one  1.488460 -0.600062 -0.092358 -0.863685 -1.053120
6 two -0.561578 -1.644408 -0.440778  0.655612  1.439717

**Grouping by Index Levels**

In [61]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                     names=['cty', 'tenor'])

In [62]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [63]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.187815 -2.172033  1.330588 -0.346277 -0.233201
1      1.274395  1.233088 -0.954452 -1.223591  0.548377
2      1.049123 -1.913270  1.293578 -0.036361 -0.567910
3     -0.348970  0.619308 -0.216686  0.478104 -0.614324

In [64]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

**Data Aggregation**

In [65]:
df

  key1 key2     data1     data2
0    a  one  1.113770  1.064311
1    a  two -0.003906 -0.334350
2    b  one -0.217493  1.096917
3    b  two  1.034529 -1.012263
4    a  one  0.400786 -0.814757

In [66]:
grouped = df.groupby('key1')

In [68]:
grouped['data1'].quantile(0.9)

key1
a    0.971173
b    0.909327
Name: data1, dtype: float64

In [69]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [70]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.117676  1.879068
b     1.252022  2.109180

In [71]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.503550  0.565880 -0.003906  0.198440  0.400786  0.757278
b      2.0  0.408518  0.885313 -0.217493  0.095512  0.408518  0.721523

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.113770   3.0 -0.028265  0.976212 -0.814757 -0.574554 -0.334350
b     1.034529   2.0  0.042327  1.491415 -1.012263 -0.484968  0.042327


           75%       max
key1
a     0.364980  1.064311
b     0.569622  1.096917

**Column-Wise and Multiple Function Application**

In [73]:
tips = pd.read_csv('./book-support/examples/tips.csv')

In [80]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [81]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [82]:
grouped = tips.groupby(['day', 'smoker'])

In [83]:
grouped_pct = grouped['tip_pct']

In [86]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [87]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [88]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [89]:
functions = ['count', 'mean', 'max']

In [90]:
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

<ipython-input-90-7d81f072985f>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result = grouped['tip_pct', 'total_bill'].agg(functions)

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [91]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [97]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [98]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

<ipython-input-98-c2b2ffd79840>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [99]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [100]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

**Returning Aggregated Data Without Row Indexes**

In [104]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

**Apply: General split-apply-combine**

In [105]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [107]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [108]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [109]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [110]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [111]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [112]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [113]:
f = lambda x: x.describe()
grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

**Suppressing the Group Keys**

In [116]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

**Quantile and Bucket Analysis**

In [117]:
frame = pd.DataFrame({'data1': np.random.randn(1000), 'data2': np.random.randn(1000)})

In [118]:
quartiles = pd.cut(frame.data1, 4)

In [125]:
quartiles[:10]

0     (0.0729, 1.517]
1     (0.0729, 1.517]
2    (-1.371, 0.0729]
3    (-2.821, -1.371]
4     (0.0729, 1.517]
5    (-1.371, 0.0729]
6    (-1.371, 0.0729]
7      (1.517, 2.961]
8    (-2.821, -1.371]
9     (0.0729, 1.517]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.821, -1.371] < (-1.371, 0.0729] < (0.0729, 1.517] < (1.517, 2.961]]

In [121]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [122]:
grouped = frame.data2.groupby(quartiles)

In [128]:
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-2.821, -1.371] -2.323504  2.488342   87.0 -0.008499
(-1.371, 0.0729] -3.164643  2.845134  451.0 -0.031889
(0.0729, 1.517]  -2.565221  2.620235  402.0  0.074602
(1.517, 2.961]   -2.158663  2.505216   60.0  0.042457

In [129]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [130]:
grouped = frame.data2.groupby(grouping)

In [131]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.323504  2.488342  100.0 -0.021335
1     -2.350230  2.845134  100.0  0.008988
2     -2.662990  2.243225  100.0 -0.192668
3     -2.275567  2.268977  100.0  0.069160
4     -3.164643  2.072271  100.0 -0.073982
5     -2.565221  2.842092  100.0  0.039701
6     -1.822167  2.349655  100.0 -0.011846
7     -2.157697  2.334793  100.0  0.057998
8     -2.381507  2.266945  100.0  0.214968
9     -2.158663  2.620235  100.0  0.083175

**Example: Filling Missing Values with Group-Specific Values**

In [132]:
s = pd.Series(np.random.randn(6))

In [133]:
s[::2] = np.nan

In [134]:
s

0         NaN
1    0.451678
2         NaN
3    0.399276
4         NaN
5    2.479169
dtype: float64

In [135]:
s.fillna(s.mean())

0    1.110041
1    0.451678
2    1.110041
3    0.399276
4    1.110041
5    2.479169
dtype: float64

In [136]:
states = ['Ohio', 'New York', 'Vermont', 'Florida', 'Oregon', 'Nevada', 'California', 'Idaho']

In [142]:
group_key = ['East'] * 4 + ['West'] * 4

In [143]:
data = pd.Series(np.random.randn(8), index=states)

In [144]:
data

Ohio         -0.369266
New York      0.362980
Vermont       0.574772
Florida      -1.774979
Oregon        1.473360
Nevada       -1.831987
California    1.147733
Idaho        -2.120278
dtype: float64

In [145]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [146]:
data

Ohio         -0.369266
New York      0.362980
Vermont            NaN
Florida      -1.774979
Oregon        1.473360
Nevada             NaN
California    1.147733
Idaho              NaN
dtype: float64

In [148]:
data.groupby(group_key).mean()

East   -0.593755
West    1.310547
dtype: float64

In [149]:
fill_mean = lambda g: g.fillna(g.mean())

In [150]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.369266
New York      0.362980
Vermont      -0.593755
Florida      -1.774979
Oregon        1.473360
Nevada        1.310547
California    1.147733
Idaho         1.310547
dtype: float64

In [151]:
fill_values = {'East': 0.5, 'West': -1}

In [152]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [154]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.369266
New York      0.362980
Vermont       0.500000
Florida      -1.774979
Oregon        1.473360
Nevada       -1.000000
California    1.147733
Idaho        -1.000000
dtype: float64

**Example: Random Sampling and Permutation**

In [155]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)
deck = pd.Series(card_val, index=cards)

In [156]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [157]:
def draw(deck, n=5):
    return deck.sample(n)

In [158]:
draw(deck)

QD    10
JC    10
KH    10
3H     3
4S     4
dtype: int64

In [159]:
get_suit = lambda card: card[-1]

In [160]:
deck.groupby(get_suit).apply(draw, n=2)

C  KC     10
   2C      2
D  QD     10
   2D      2
H  KH     10
   6H      6
S  2S      2
   10S    10
dtype: int64

In [161]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

10C    10
3C      3
6D      6
KD     10
10H    10
JH     10
3S      3
7S      7
dtype: int64

**Example: Group Weighted Average and Correlation**

In [164]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [165]:
df

  category      data   weights
0        a  0.569822  0.940770
1        a  0.679502  0.124484
2        a -0.598138  0.074109
3        a  0.348268  0.353448
4        b  0.098611  0.091192
5        b -0.027313  0.290312
6        b -1.809781  0.289508
7        b -1.172604  0.227417

In [167]:
grouped = df.groupby('category')

In [168]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [169]:
grouped.apply(get_wavg)

category
a    0.468530
b   -0.878815
dtype: float64

In [170]:
close_px = pd.read_csv('./book-support/examples/stock_px_2.csv', parse_dates=True,
    index_col=0)

In [172]:
close_px.info();

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 86.5 KB

In [173]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [174]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [175]:
rets = close_px.pct_change().dropna()

In [176]:
get_year = lambda x: x.year

In [178]:
by_year = rets.groupby(get_year)

In [179]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [180]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

**Example: Group-Wise Linear Regression**

In [182]:
!pip install statsmodels

Collecting statsmodels
  Using cached statsmodels-0.11.1-cp38-none-win_amd64.whl (8.3 MB)
Collecting patsy>=0.5
  Using cached patsy-0.5.1-py2.py3-none-any.whl (231 kB)
Requirement already satisfied: numpy>=1.14 in c:\projects\data-science\projects\python-for-data-analysis\env\lib\site-packages (from statsmodels) (1.18.1)
Requirement already satisfied: pandas>=0.21 in c:\projects\data-science\projects\python-for-data-analysis\env\lib\site-packages (from statsmodels) (1.0.3)
Requirement already satisfied: scipy>=1.0 in c:\projects\data-science\projects\python-for-data-analysis\env\lib\site-packages (from statsmodels) (1.4.1)
Requirement already satisfied: six in c:\users\renat\appdata\roaming\python\python38\site-packages (from patsy>=0.5->statsmodels) (1.14.0)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\projects\data-science\projects\python-for-data-analysis\env\lib\site-packages (from pandas>=0.21->statsmodels) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\projects\data-science\projects\python-for-data-analysis\env\lib\site-packages (from pandas>=0.21->statsmodels) (2020.1)
Installing collected packages: patsy, statsmodels
Successfully installed patsy-0.5.1 statsmodels-0.11.1

In [183]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [184]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

 **Pivot Tables and Cross-Tabulation**

In [185]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [186]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [187]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [188]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day', aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106.0
       Yes      9.0  42.0  19.0   NaN   70.0
Lunch  No       1.0   NaN   NaN  44.0   45.0
       Yes      6.0   NaN   NaN  17.0   23.0
All            19.0  87.0  76.0  62.0  244.0

In [190]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                            columns='day', aggfunc='mean',
                            fill_value=0)

day                      Fri       Sat       Sun      Thur
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000
            Yes     0.000000  0.325733  0.000000  0.000000
       2    No      0.139622  0.162705  0.168859  0.159744
            Yes     0.171297  0.148668  0.207893  0.000000
       3    No      0.000000  0.154661  0.152663  0.000000
            Yes     0.000000  0.144995  0.152660  0.000000
       4    No      0.000000  0.150096  0.148143  0.000000
            Yes     0.117750  0.124515  0.193370  0.000000
       5    No      0.000000  0.000000  0.206928  0.000000
            Yes     0.000000  0.106572  0.065660  0.000000
       6    No      0.000000  0.000000  0.103799  0.000000
Lunch  1    No      0.000000  0.000000  0.000000  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000
       2    No      0.000000  0.000000  0.000000  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843
       3    No      0.187735  0.000000  0.000000  0.084246
            Yes     0.000000  0.000000  0.000000  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706

**Cross-Tabulations: Crosstab**

A cross-tabulation (or crosstab for short) is a special case of a pivot table that com
putes group frequencies

In [192]:
data

Ohio         -0.369266
New York      0.362980
Vermont            NaN
Florida      -1.774979
Oregon        1.473360
Nevada             NaN
California    1.147733
Idaho              NaN
dtype: float64

In [193]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244